# Missing Data in Pandas

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to show missing data in Pandas.
</br>
Happy Learning üê±‚Äçüèç

In [27]:
import pandas as pd
import numpy as np

In [28]:
s=pd.Series(["Sam",np.nan,"Tim","Kim"]) 
s

0    Sam
1    NaN
2    Tim
3    Kim
dtype: object

In [29]:
s.isnull() #check for missing values

0    False
1     True
2    False
3    False
dtype: bool

In [30]:
s.notnull() #check for non-missing values

0     True
1    False
2     True
3     True
dtype: bool

In [31]:
s[3]=None #set a value to None
s.isnull()  #check for missing values

0    False
1     True
2    False
3     True
dtype: bool

In [32]:
s.dropna() #drop missing values

0    Sam
2    Tim
dtype: object

In [33]:
from numpy import nan as NA #import NA from numpy as nan

In [34]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]]) 
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [35]:
df.dropna() #drop missing values (borra toda la fila si hay un NA)

     0    1    2
0  1.0  2.0  3.0

In [36]:
df.dropna(how="all") #drop rows where all values are NA

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0

In [37]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [38]:
df[1]=NA #set a column to NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [39]:
df.dropna(axis=1,how="all") #drop columns where all values are NA

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [40]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [41]:
df.dropna(thresh=3) #drop rows with less than 3 non-NA values ???
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [42]:
df.fillna(0) #fill missing values with 0

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [43]:
df.fillna({0:15,1:25,2:35}) #fill missing values with different values for each column (fila 1 con 15, fila dos con 25...)

      0     1     2
0   1.0  25.0   3.0
1   4.0  25.0   5.0
2  15.0  25.0  35.0

In [44]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [45]:
df.fillna(0,inplace=True) #fill missing values with 0 and modify the original
df

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [46]:
df=pd.DataFrame([[1,2,3],[4,NA,5],
                 [NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [47]:
df.fillna(method="ffill") #fill missing values with the previous value

C:\Users\javie\AppData\Local\Temp\ipykernel_1860\3944122520.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  2.0  5.0

In [48]:
df.fillna(method="ffill",limit=1) #fill missing values with the previous value, but only one time

C:\Users\javie\AppData\Local\Temp\ipykernel_1860\1059200199.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=1)

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  4.0  NaN  5.0

In [49]:
data=pd.Series([1,0,NA,5]) 
data

0    1.0
1    0.0
2    NaN
3    5.0
dtype: float64

In [50]:
data.fillna(data.mean()) #fill missing values with the mean

0    1.0
1    0.0
2    2.0
3    5.0
dtype: float64

In [51]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [52]:
df.fillna(df.mean())   #fill missing values with the mean

     0    1    2
0  1.0  2.0  3.0
1  4.0  2.0  5.0
2  2.5  2.0  4.0

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé